#pragma once
#include <vector>
#include <string>

// Вершина графа (перекресток, поворот или тупик на тропинке парка)
struct Node {
    long long id = 0;       // Уникальный ID точки из OpenStreetMap
    double lat = 0.0;         // Географическая широта (в градусах GPS)
    double lon = 0.0;         // Географическая долгота (в градусах GPS)
    float x = 0.0f;            // Рассчитанная координата X на экране (в пикселях для Raylib/SFML)
    float y = 0.0f;            // Рассчитанная координата Y на экране (в пикселях для Raylib/SFML)
    std::string name = "";   // Текстовое название объекта (если есть, например "Фонтан", "Вход")
};

// Ребро графа (отрезок пешеходной дорожки между двумя вершинами)
struct Edge {
    long long to;       // ID вершины, в которую ведет этот отрезок дороги
    double weight;      // Реальная длина дорожки в метрах (вес ребра для алгоритмов)
    std::string type;   // Тип дорожки (например: "footway", "path", "cycleway")
};

// Результат работы навигатора (готовый построенный маршрут и бенчмарк)
struct ShortestPath {
    std::vector<long long> node_ids; // Цепочка ID вершин от старта до финиша по порядку
    double total_length = 0.0;       // Общая длина всего пути в метрах
    double execution_time_ms = 0.0;  // Время работы алгоритма в миллисекундах (для сравнения)
    bool success = false;            // Найдена ли цель (флаг успешности поиска)
};
